Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes Properties
The DimensionSetBaseAttributes type exposes the following members.
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the dimension.
Color
 The color of the dimension line.
Format
 The format attributes of the dimension.
Placing
 The placing attributes of the dimension.
Text
 The text attributes of the dimension.
TransparentBackground
 The dimension text background transparency. (transparent/opaque)
TrueColor
 The true color (RGB enabled) of the dimension line.
Top
See Also
Reference
DimensionSetBaseAttributes Class
Tekla.Structures.Drawing Namespace